In [2]:
import pandas as pd

In [3]:
data = [[1, 1], [1, 2], [1, 3], [2, 1], [2, 4]]
project = pd.DataFrame(data, columns=['project_id', 'employee_id']).astype({'project_id':'Int64', 'employee_id':'Int64'})
data = [[1, 'Khaled', 3], [2, 'Ali', 2], [3, 'John', 1], [4, 'Doe', 2]]
employee = pd.DataFrame(data, columns=['employee_id', 'name', 'experience_years']).astype({'employee_id':'Int64', 'name':'object', 'experience_years':'Int64'})

In [4]:
project

   project_id  employee_id
0           1            1
1           1            2
2           1            3
3           2            1
4           2            4

In [5]:
employee

   employee_id    name  experience_years
0            1  Khaled                 3
1            2     Ali                 2
2            3    John                 1
3            4     Doe                 2

Write an SQL query that reports the average experience years of all the employees for each project, rounded to 2 digits.

Return the result table in any order.

The query result format is in the following example.

In [13]:
project_years=project.merge(right=employee,on="employee_id",how="left").drop(["employee_id","name"],axis=1).fillna(value="experience_years")
project_years

   project_id  experience_years
0           1                 3
1           1                 2
2           1                 1
3           2                 3
4           2                 2

In [21]:
project_years.groupby(by="project_id").mean().reset_index().rename(columns={"experience_years":"average_years"}).round({"average_years":2})

   project_id  average_years
0           1            2.0
1           2            2.5